Database will be created in the given location

In [13]:
import sqlite3

In [14]:
db1=sqlite3.connect("E:/bhupendra/28augstudent.db")

In [15]:
cur1=db1.cursor()

In [16]:
cur1.execute("create table employee(id int,name text,age int)")

OperationalError: table employee already exists

In [17]:
# csv (coma separeted value)

# Adding data in table with csv(comma separated values) file directly

In [18]:
import sqlite3

In [19]:
db=sqlite3.connect("E:/bhupendra/scores_database.db")

# Declare curser
cursor = db.cursor()

In [20]:
# create table
cursor.execute("CREATE TABLE scores(gender TEXT, student_id INT PRIMARY KEY, marks INT)")

OperationalError: table scores already exists

In [21]:
# insert records in to the table. (single record inserting)
cursor.execute("INSERT INTO scores(gender, student_id, marks) values('male', 100, 55)")

# save the rocord permenently. ( if you dont commit, text time you will not see the rocord in the table)
db.commit()

# Count of records inserted
print(cursor.rowcount,"record(s) inserted")

IntegrityError: UNIQUE constraint failed: scores.student_id

# Inserting records from cvs fileÂ¶

In [22]:
with open('Scores_file.csv','r') as file:
    total_records=0
    for row in file:
        cursor.execute("insert into scores values(?,?,?)",row.split(","))
        db.commit()
        total_records+=1
print(total_records,'Records inserted')

IntegrityError: UNIQUE constraint failed: scores.student_id

In [23]:
result = cursor.execute("SELECT * FROM scores")
for row in result:
    print(row)

('male', 100, 55)
('male', 104, 56)
('male', 105, 78)
('female', 106, 36)
('male', 107, 20)
('female', 108, 98)
('male', 109, 85)
('female', 110, 69)
('male', 111, 46)
('female', 112, 66)
('male', 113, 91)
('male', 114, 48)
('male', 115, 56)
('female', 116, 67)
('male', 117, 78)
('male', 118, 89)
('male', 119, 32)
('female', 120, 44)

In [24]:
sql = "SELECT * from scores WHERE student_id = 104"
result = cursor.execute(sql)
for row in result:
    print(row)

('male', 104, 56)

In [25]:
# how to change the order of records (Incresing or decresing)
result = cursor.execute("SELECT * FROM scores ORDER BY marks desc")
for row in result:
    print(row)

('female', 108, 98)
('male', 113, 91)
('male', 118, 89)
('male', 109, 85)
('male', 105, 78)
('male', 117, 78)
('female', 110, 69)
('female', 116, 67)
('female', 112, 66)
('male', 104, 56)
('male', 115, 56)
('male', 100, 55)
('male', 114, 48)
('male', 111, 46)
('female', 120, 44)
('female', 106, 36)
('male', 119, 32)
('male', 107, 20)

In [26]:
# MiX
result = cursor.execute("SELECT MIN(marks) FROM scores")
print ('minimum marks = ', result.fetchone())

minimum marks =  (20,)

In [27]:
# MAX
result = cursor.execute("SELECT MAX(marks) FROM scores")
print ('maximum marks = ', result.fetchone())

maximum marks =  (98,)

In [28]:
# db.close()

# Exercise 2 SQlite3

In [29]:
import sqlite3

Adding date in table

In [30]:
db=sqlite3.connect("E:/bhupendra/sport_database.db")

In [31]:
cur=db.cursor()

constrains ----
unique --enter only unique value , no duplicate values
not null -- no blank values can be inserted in table

In [32]:
cur.execute("create table sport (id int primary key,sportname text unique,dateofevent date, country text not null)")

OperationalError: table sport already exists

In [33]:
cur.execute("insert into sport values(1,'cricket','2021-11-9','england')")

#this line will throw error as sportname is duplicate ---unique constraint failed

#cur.execute("insert into sport value(2,'cricket','2018-08-02','srilanka')")

In [34]:
cur.execute("insert into sport values(2,'tennis','2018-08-02','srilanka')")
print(cur.rowcount,"record(s) inserted ")

1 record(s) inserted

In [35]:
results=cur.execute('select * from sport')

results.fetchall()

[(1, 'cricket', '2021-11-9', 'england'),
 (2, 'tennis', '2018-08-02', 'srilanka')]

#this query throw error : not null constrint : can not leave any field blank

#cur.execute("insert in to sport values(3,'football','2022-05-30',null)")

In [36]:
results =cur.execute("insert into sport values(3,'football','2022-05-30','australia')")
db.commit;

In [37]:
results=cur.execute('select * from sport')

results.fetchall()

[(1, 'cricket', '2021-11-9', 'england'),
 (2, 'tennis', '2018-08-02', 'srilanka'),
 (3, 'football', '2022-05-30', 'australia')]

# Epmloyee database with DB and pythone programmatically

In [70]:
import sqlite3

In [84]:
con=sqlite3.connect("E:/bhupendra/employee_databas.db")

In [85]:
def sql_table(con):
    cur=con.cursor()
    cur.execute("create table employee(id integer primary key,name text,salary real,department text,position text,hiredate date)")
    con.commit()

In [116]:
cur=con.cursor()

In [117]:
#calling function

sql_table(con)

OperationalError: table employee already exists

In [118]:
cur=con.cursor()
cur.execute("insert into employee values(1,'jack',9000,'hr','manager','2019-07-09')")

IntegrityError: UNIQUE constraint failed: employee.id

In [119]:
con.commit;

In [120]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'martin', 9000.0, 'hr', 'manager', '2019-07-09'),
 (2, 'andrew', 7000.0, 'it', 'engineer', '2015-04-06'),
 (4, 'rudolf', 8000.0, 'it', 'engineer', '2012-08-23')]

In [125]:
results=cur.execute("select id as empid,name as empname from employee")
results.fetchall()

[(1, 'martin'), (2, 'andrew'), (4, 'rudolf')]

we can also pass values/arguments to an INSERT statement in thje execute() method.you can use the
question mark(?) as a placeholder for each value. the syntex of the INSERT will be like the following.

cur.execute('''insert into emloyee(id,name,salary,department,position,hiredate)
values(?,?,?,?,?,?)''',entities)

entities=(2,'john',4000'IT','Engineer','2018-02-06')

In [121]:
def sql_insert(con,entities):
    cur=con.cursor()
    cur.execute('insert into employee(id,name,salary,department,position,hiredate) values(?,?,?,?,?,?)',entities)

In [122]:
entities=(2,'andrew',7000,'it','engineer','2015-04-06')

In [123]:
#calling sql insert to insert the data

sql_insert(con,entities)

IntegrityError: UNIQUE constraint failed: employee.id

In [124]:
entities=(3, 'thomas', 6000 'hr','manager', '2016-06-04')

SyntaxError: invalid syntax (3066824686.py, line 1)

In [94]:
sql_insert(con,entities)

IntegrityError: UNIQUE constraint failed: employee.id

In [95]:
results=cur.execute(select * from employee)
results.fetchall()

SyntaxError: invalid syntax (3504589594.py, line 1)

In [97]:
entities=(4, 'rudolf', 8000, 'it', 'engineer', '2012-08-23')

sql_insert(con,entities)

entities=(5, 'suzen', 10000, 'sales executive', '2018-02-19')

sql_insert(con,entities)

ProgrammingError: Incorrect number of bindings supplied. The current statement uses 6, and there are 5 supplied.

In [98]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'jack', 9000.0, 'hr', 'manager', '2019-07-09'),
 (2, 'andrew', 7000.0, 'it', 'engineer', '2015-04-06'),
 (4, 'rudolf', 8000.0, 'it', 'engineer', '2012-08-23')]

In [99]:
def sql_update(con):
    cur=con.cursor()
    cur.execute('update employee set name="martin" where id=1')
    con.commit()

In [100]:
sql_update(con)

In [101]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'martin', 9000.0, 'hr', 'manager', '2019-07-09'),
 (2, 'andrew', 7000.0, 'it', 'engineer', '2015-04-06'),
 (4, 'rudolf', 8000.0, 'it', 'engineer', '2012-08-23')]

In [102]:
results=cur.execute('select id, name from employee')
results.fetchall()

[(1, 'martin'), (2, 'andrew'), (4, 'rudolf')]

In [104]:
results=cur.execute('select id,name from employee where salary >8000')

results.fetchall()

[(1, 'martin')]

In [105]:
results=cur.execute("select id,name from employee where department in ('hr')")
results.fetchall()

[(1, 'martin')]

In [106]:
results=cur.execute("select min(salary) from employee")
results.fetchall()

[(7000.0,)]

In [107]:
results=cur.execute("select count(id) from employee")
results.fetchall()

[(3,)]

In [108]:
results=cur.execute("select distinct(department) from employee")
results.fetchall()

[('hr',), ('it',)]

In [109]:
results=cur.execute("select count(distinct(department)) from employee")
results.fetchall()

[(2,)]

In [110]:
results=cur.execute("select sum(salary),position from employee group by position")
results.fetchall()

[(15000.0, 'engineer'), (9000.0, 'manager')]

In [111]:
results=cur.execute("select sum(salary),department from employee group by department")
results.fetchall()

[(9000.0, 'hr'), (15000.0, 'it')]

In [112]:
def sql_query(sql):
    cur=con.cursor()
    results=cur.execute(sql)
    return results

In [114]:
# make query
sql="select * from employee"

# pass query in function
respond=sql_query(sql)
respond.fetchall()

[(1, 'martin', 9000.0, 'hr', 'manager', '2019-07-09'),
 (2, 'andrew', 7000.0, 'it', 'engineer', '2015-04-06'),
 (4, 'rudolf', 8000.0, 'it', 'engineer', '2012-08-23')]

In [115]:
sql="select id, name, position from employee"

#pass query in function
respond=sql_query(sql)
respond.fetchall()

[(1, 'martin', 'manager'),
 (2, 'andrew', 'engineer'),
 (4, 'rudolf', 'engineer')]